Autodesk.Navisworks.Api.Schema.SchemaDefinition
Schema definitions are used to define data structures that are then created as schema data objects for use with various Navisworks API calls.

Autodesk.Navisworks.Api.Schema.SchemaDefinition.Concepts
The concepts that this definition implements.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaDefinition.CreateData
Creates a concrete data object to hold values structured according to the Fields within this definition.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaDefinition.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Schema.SchemaDefinition.Fields
The top level of Fields within this definition.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaDefinition.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Schema.SchemaDefinition.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.SchemaDefinition.ValueEquals(Autodesk.Navisworks.Api.Schema.SchemaDefinition)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.Schema.SchemaDefinition.ValueEquals(Autodesk.Navisworks.Api.Schema.SchemaDefinition,Autodesk.Navisworks.Api.Schema.SchemaDefinition)
Compares the two references 'By Value'